# BeamSystemEdgeBeamTooWide Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BeamSystemFailures..::..BeamSystemEdgeBeamTooWide Property
BuiltInFailures..::..BeamSystemFailures Class See Also
---
Beam of user-defined type does not fit into beam system with clear spacing layout rule. Beam type is reset to default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BeamSystemEdgeBeamTooWide { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BeamSystemEdgeBeamTooWide As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BeamSystemEdgeBeamTooWide {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..BeamSystemFailures Class
Autodesk.Revit.DB Namespace